app/controllers/bookings_controller.rb

  def create
    @booking = Booking.new(booking_params)
    @booking.save
---
INSERT INTO "bookings" ("created_at", "name", "price", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-03-10 19:02:44.652439"], ["name", "sd"], ["price", 0.0], ["updated_at", "2015-03-10 19:02:44.652439"]]

  def destroy
    @booking.destroy
---
DELETE FROM "bookings" WHERE "bookings"."id" = ?  [["id", 1]]