app/controllers/musics_controller.rb

SELECT "musics".* FROM "musics"
---
  def index
    @musics = Music.all

INSERT INTO "musics" ("attachment", "created_at", "description", "name", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["attachment", "goddamitobrien.jpg"], ["created_at", "2015-03-06 00:19:39.492144"], ["description", "dfg"], ["name", "fg"], ["title", "gdf"], ["updated_at", "2015-03-06 00:19:39.492144"]]
---
  def create
    @music = Music.new(music_params)
    # render json:params
      if  @music.save

DELETE FROM "musics" WHERE "musics"."id" = ?  [["id", 1]]
---
  def destroy
    @music.destroy

SELECT  "musics".* FROM "musics"  WHERE "musics"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_music
      @music = Music.find(params[:id])