app/controllers/parseusers_controller.rb

SELECT "parseusers".* FROM "parseusers"
---
  def index
    @parseusers = Parseuser.all

INSERT INTO "parseusers" ("created_at", "email", "name", "password", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-03-18 17:10:07.831352"], ["email", "d@boobs.com"], ["name", "d"], ["password", "tits"], ["updated_at", "2015-03-18 17:10:07.831352"]]
---
  def create
    @parseuser = Parseuser.new(parseuser_params)
    @parseuser.save

SELECT  "parseusers".* FROM "parseusers"  WHERE "parseusers"."id" = ? LIMIT 1  [["id", 11]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
---
    def set_parseuser
      @parseuser = Parseuser.find(params[:id])